%%Ò»Î¬ÏßÕó
%clear all
close all
clc
%tic %Æô¶¯¼ÆÊ±Æ÷
derad = pi/180;        % deg -> rad£¬ 1¡ã=£¨¦°/180¡ã£©rad
radeg = 180/pi;     %1 rad=180¡ã/¦°
twpi = 2*pi;
%% ¸÷ÖÖ³õÖµ
kelm = 8;               % ÕóÔªÊıÁ¿
dd = 0.5;               % ÕóÔ´¼ä¾à
d=0:dd:(kelm-1)*dd;     % ´Ó0¿ªÊ¼¸ô0.5Ò»¸öÕóÔª£¬Ò»Ö±µ½µÚ°Ë¸öÕóÔª
iwave = 3;              % number of DOA  ĞÅºÅÔ´Êı
theta = [12 30 60];     % ½Ç¶È  ²¨´ï·½Ïò ÈëÉä½Ç¶È
% iwave = 4;              % number of DOA  ĞÅºÅÔ´Êı
% theta = [10 30 60 50];     % ½Ç¶È  ²¨´ï·½Ïò ÈëÉä½Ç¶È

snr = 10;               % input SNR (dB)£¬ĞÅÔë±È
n = 500;                 % ²ÉÑùµã
%% ¹¹½¨½ÓÊÕÄ£ĞÍ£¬ºÍĞÅºÅÄ£ĞÍ
A=exp(-1i*twpi*d.'*sin(theta*derad));%%%% direction matrix·½ÏòÊ¸Á¿,ÕóÁĞÁ÷ĞÎ
S=randn(iwave,n);       %ĞÅºÅÔ´ĞÅºÅ£¬3*500Î¬ÕıÌ¬·Ö²¼Ëæ»ú¾ØÕó
X=A*S;                  %½ÓÊÕĞÅºÅ
X1=awgn(X,snr,'measured');   %ÏòĞÅºÅX1Ìí¼Ó¸ßË¹°×ÔëÉù£¬ĞÅÔë±Èsnrµ¥Î»dB,Ìí¼ÓÇ°¼ÆËãĞÅºÅX¹¦ÂÊdBW
%% ¼ÆËãĞ­·½²î¾ØÕó
r2=X1';  %ÕâÀï½øĞĞ×ªÖÃ£¬·½±ã½ÓÏÂÀ´ËãĞ­·½²î
Rxx=X1*X1'/n;   %¼ÆËãĞ­·½²î¾ØÕó,ÕâÀïÊÇĞ­·½²î¾ØÕóµÄ¹À¼ÆÖµ,Õı³£Ëã¿ìÒ»Ğ©
%Rxx=cov(r2);   %ÕâÖÖ·½·¨Ò²¿ÉËãĞ­·½²î¾ØÕó£¬ÓëÉÏÊö½á¹ûÏàÍ¬£¬µ«×¢ÒâÒªÏÈ°Ñ¾ØÕó×ªÖÃ
%% ÌØÕ÷Öµ·Ö½â£¬²¢ÇÒ°ÑÌØÕ÷ÖµÅÅĞò
[EV,D]=eig(Rxx);%%%% ÌØÕ÷Öµ·Ö½â£¬¼ÆËãRxxµÄÌØÕ÷Öµ¶Ô½ÇÕóD£¡£¡£¡ºÍÌØÕ÷ÏòÁ¿¹¹³ÉµÄ¾ØÕóEV
EVA=diag(D)';%³éÈ¡¾ØÕóD¶Ô½ÇÔªËØ¹¹³ÉÏòÁ¿EVA£¬ÔÙÇóEVAµÄ¹²éî×ªÖÃ¾ØÕó(ÕâÀïÊÇ²»ÊÇ¹²éîÃ»ÓĞÇø±ğ£¬¶¼ÊÇÊµÊı)
% EVA1=diag(D)';
% EVA2=diag(D).';
% EVA3=diag(D);
[EVA,I]=sort(EVA);%ÌØÕ÷Öµ´ÓĞ¡µ½´óÅÅĞò£¬½«EVAÅÅĞò£¬²¢·µ»ØÒ»¸öÓëEVAÍ¬ĞÍµÄ¾ØÕóI£¬£¨IÎªË÷Òı£¬Ö¸¶¨ĞÂ¾ØÕóÖĞµÄ¸÷ÔªËØÔÚÔ­¾ØÕóÖĞµÄÎ»ÖÃ£©
% [B,I]=sort(EVA1);
% EVAt=fliplr(EVA1);
EVA=fliplr(EVA);%×óÓÒ·­×ª£¬´Ó´óµ½Ğ¡ÅÅĞò
EV=fliplr(EV(:,I));%¶ÔÌØÕ÷Ê¸Á¿ÅÅĞò
%% MUSIC
%tic
angle=zeros(1,361);  %ÕâÀïÔ¤·ÖÅäÒ»ÏÂÄÚ´æ£¬¿ÉÒÔËõ¶ÌÊ±¼ä£¨²¢Ã»ÓĞ£©
SP=zeros(1,361);     %²¢Ã»ÓÅ»¯¶àÉÙ
SP2=zeros(1,361);

for iang = 1:361 %Í¨¹ı±ä»¯¦ÈËÑË÷¿Õ¼äÆ×
        angle(iang)=(iang-181)/2;%¹¹³ÉÁËÒ»¸ö1*361µÄ¾ØÕó£¬´Ó-90¡ãµ½+90¡ã
        phim=derad*angle(iang); %´Ó½Ç¶È×ª»¯³É»¡¶È
        a=exp(-1i*twpi*d*sin(phim)).'; %ĞÅºÅµÄÌØÕ÷ÏòÁ¿
        %a=exp(-j*twpi*d*sin(phim))';%Èç¹û²»¹²éîµÄ»°£¬½á¹ûÕıºÃÏà·´
        L=iwave;    %ĞÅºÅÔ´Êı
        En=EV(:,L+1:kelm);%´ÓĞÅÔ´Êı+1Ò»Ö±µ½ÕóÔªÊı¸öÌØÕ÷ÏòÁ¿£¬¹¹³ÉÁËÔëÉù×Ó¿Õ¼ä£¨Ç°ĞÅÔ´Êı¸öÌØÕ÷ÏòÁ¿ÎªĞÅºÅ×Ó¿Õ¼ä£©
        SP(iang)=(a'*a)/(a'*(En*En')*a);%SPÓëangleÒ»Ò»¶ÔÓ¦£¬ÕâÀïµÃµ½µÄ½á¹û¾ùÎª¸´Êı
        %%ÕóÁĞµÄ¿Õ¼äÆ×º¯Êı
        % 
        % $$P_{MUSIC}(\theta)=\frac{1}{\alpha^H(\theta)*U_N*U_N^H*\alpha(\theta)}$$
        % 
        
end
%toc  
%% Çóº¯ÊıµÄ¼«´óÖµ
SP=abs(SP);%Çó¸´ÊıSPµÄÄ££¬ÓÃÓÚ±È½Ï´óĞ¡£¬Çó×î´óÖµ
 %SP1=abs(SP2);
SPmax=max(SP);%ÈçSPÎªÒ»ÏòÁ¿Ôò·µ»Ø¸÷ÔªËØÖĞµÄ×î´óÖµ£¬Èç¹ûSPÎª¾ØÕóÔò·µ»Ø¸÷ÁĞÔªËØ×î´óÖµ¹¹³ÉµÄĞĞÏòÁ¿
%SPmax2=max(SP1);
SP=10*log10(SP/SPmax);
[Te,A]=sort(SP);  %´Ë´¦ÅÅĞò
[l,p]=findpeaks(SP,iwave);%ËÑË÷Æ×·åº¯Êı
WM=angle(A(359:361));%´Ë´¦Îª¼ÆËãµÃµÄ½Ç¶È£¬Ñ¡³öÇ°3´óµÄ
WM1=angle(l);
%% »æÍ¼
save('data.mat','angle','SP')  %±£´æÊı¾İ
%fig = figure;                 
%fig.Position = get(0,'ScreenSize');%°ÑÍ¼Æ¬×î´ó»¯

h=plot(angle,SP); %ºáÖá½Ç¶È£¬×İÖá·ù¶È
hold on
plot(WM1,p,'r*');
set(h,'Linewidth',2) %ÉèÖÃÏß¿í
xlabel('angle (degree)')
ylabel('magnitude (dB)')
axis([-90 90 -60 10])
set(gca, 'XTick',(-90:30:90))
grid on  
zoom on %×÷Í¼ºó´ò¿ª·Å´ó¹¦ÄÜ


%disp(A)
%toc   %ÏÔÊ¾ËùÓÃÊ±¼ä
% load handel;
% sound(y,Fs);



